<div class="container-fluid pt-3 px-3">
    <div class="row">
        <!-- calendar Start-->
        <div class="col-sm-12 col-md-12 col-xl-12">
            <div class="h-100 bg-light rounded p-4">
                <h5 class="mb-0 text-dark">โรคที่พบบ่อยในไก่ไข่ และ วิธีการดูแลรักษา</h5>

                <div class="text-center">
                    <img src='My_img/treatment-plan.png' style='width: auto; height: 70px;'>
                </div>

                <a style="color: #5a68b8; font-size: 17px;"> - โรคนิวคาสเซิล (Newcastle Disease)</a>
                <a>
                    อาการ : ซึม เบื่ออาหาร มีน้ำมูกไหล หายใจเสียงดัง อาจพบอาการทางประสาท เช่น คอบิดหรือหัวเอียง<br>
                    การดูแลรักษา : ยังไม่มีวิธีรักษา ให้เน้นป้องกันโดยการฉีดวัคซีน ควรทำความสะอาดและฆ่าเชื้อคอกเลี้ยงสม่ำเสมอ
                    แยกไก่ที่ป่วยออกจากฝูงทันที
                </a><br>

                <a style="color: #5a68b8; font-size: 17px;"> - โรคหลอดลมอักเสบติดต่อ (Infectious Bronchitis)</a>
                <a>
                    อาการ : ไก่ไอ จาม น้ำมูกไหล การวางไข่ลดลง ไข่มีลักษณะเปลือกบางหรือผิดรูป<br>
                    การดูแลรักษา : ฉีดวัคซีนป้องกัน รักษาความสะอาดของเล้าไก่และอากาศถ่ายเท ใช้ยาปฏิชีวนะตามคำแนะนำของสัตวแพทย์ในกรณีที่เกิดการติดเชื้อแบคทีเรียแทรกซ้อน
                </a><br>

                <a style="color: #5a68b8; font-size: 17px;"> - โรคบิด (Coccidiosis)</a>
                <a>
                    อาการ : ถ่ายเหลวหรือถ่ายเป็นเลือด ไก่อ่อนแรง น้ำหนักลด <br>
                    การดูแลรักษา : ใช้ยาป้องกันโรคบิด ผสมในอาหารหรือน้ำ รักษาความสะอาดของอาหารและน้ำดื่ม เปลี่ยนพื้นรองเล้าอย่างสม่ำเสมอ
                </a><br>

                <a style="color: #5a68b8; font-size: 17px;"> - โรคอหิวาต์ไก่ (Fowl Cholera)</a>
                <a>
                    อาการ : ไก่ซึม เบื่ออาหาร หายใจลำบาก มีจุดเลือดออกใต้ผิวหนัง<br>
                    การดูแลรักษา : ใช้ยาปฏิชีวนะเช่น ซัลฟา หรือยาเพนนิซิลลินตามคำแนะนำของสัตวแพทย์ ฉีดวัคซีนป้องกันในไก่โต
                </a><br>

                <a style="color: #5a68b8; font-size: 17px;"> - ปัญหาไข่เปลือกบาง (Soft Shell Eggs)</a>
                <a>
                    สาเหตุ : ขาดแคลเซียมในอาหาร ความเครียดหรือการเปลี่ยนแปลงสภาพแวดล้อม<br>
                    การดูแลรักษา : ให้อาหารเสริมแคลเซียม เช่น เปลือกหอยบด ลดความเครียดในเล้า เช่น การรักษาสภาพแวดล้อมให้นิ่งและสงบ
                </a><br>

                <a style="color: #5a68b8; font-size: 17px;"> - โรคมาลิก (Marek's Disease) </a>
                <a>
                    อาการ : อ่อนแรง ขาหรือปีกเป็นอัมพาต อาจเกิดก้อนเนื้องอกในอวัยวะภายใน
                    การดูแลรักษา : ยังไม่มีวิธีรักษา ควรฉีดวัคซีนตั้งแต่ไก่ยังเล็ก แยกไก่ที่ติดเชื้อออกเพื่อป้องกันการระบาด
                </a>
            </div>
        </div>
        <!-- calendar End-->
    </div>
</div><br>