<select class="form-select">
    <option selected>ผู้ดูแลภายนอก</option>

    <!-- คณะครุศาสตร์ -->
        <option value="11">สาขาวิชาคณิตศาสตร์</option>
        <option value="12">สาขาวิชาวิทยาศาสตร์</option>
        <option value="13">สาขาวิชาสังคมศึกษา</option>
        <option value="14">สาขาวิชาการศึกษาปฐมวัย</option>
        <option value="15">สาขาวิชาคอมพิวเตอร์ศึกษา</option>
        <option value="16">สาขาวิชาพลศึกษา</option>
        <option value="17">สาขาวิชาการสอนภาษาไทย</option>
        <option value="">สาขาวิชาการสอนภาษาอังกฤษ</option>
        <option value="">สาขาวิชาการประถมศึกษา</option>
        <option value="">สาขาวิชาการศึกษาพิเศษ</option>

    <!-- คณะมนุษยศาสตร์และสังคมศาสตร์ -->

        <!-- ภาควิชามนุษยศาสตร์ -->
            <option value="">สาขาวิชาภาษาไทย</option>
            <option value="">สาขาวิชาภาษาอังกฤษ</option>
            <option value="">สาขาวิชาภาษาญี่ปุ่น</option>
            <option value="">สาขาวิชานาฏศิลป์ศึกษา</option>
            <option value="">สาขาวิชาดนตรีศึกษา</option>
            <option value="">สาขาวิชาดนตรีสร้างสรรค์</option>
            <option value="">สาขาวิชาศิลปศึกษา</option>
            <option value="">สาขาวิชาสหวิทยาการอิสลามเพื่อการพัฒนา</option>
            <option value="">สาขาการสอนภาษาจีน</option>

            <!-- ภาควิชาสังคมศาสตร์ -->
            <option value="">สาขาวิชารัฐประศาสนศาสตร์</option>
            <option value="">สาขาวิชาการพัฒนาชุมชนและสังคม</option>
            <option value="">สาขาวิชานิเทศศาสตร์ดิจิทัล</option>
            <option value="">สาขาวิชานิติศาสตร์</option>
            <option value="">สาขาวิชาประวัติศาสตร์</option>
            <option value="">สาขาวิชาการจัดการรัฐกิจและการปกครองท้องถิ่น</option>

            <!-- กลุ่มวิชา -->
            <option value="">สาขาวิชาภูมิศาสตร์</option>
            <option value="">สาขาวิชาปรัชญาและศาสนา</option>
            <option value="">สาขาวิชาบรรณารักษศาสตร์</option>

    <!-- คณะวิทยาศาสตร์และเทคโนโลยี -->

        <!-- ภาควิชาวิทยาศาสตร์ -->
            <option value="">สาขาวิชาเคมี</option>
            <option value="">สาขาวิชาวิทยาการคอมพิวเตอร์</option>
            <option value="">สาขาวิชาจุลชีววิทยา</option>
            <option value="">สาขาวิชาคณิตศาสตร์ประยุกต์</option>
            <option value="">สาขาวิชาเทคโนโลยีสารสนเทศ</option>
            <option value="">สาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม</option>
            <option value="">สาขาวิชาวิทยาศาสตร์ศึกษา (แขนงวิชาฟิสิกส์)</option>
            <option value="">สาขาวิชาวิทยาศาสตร์ศึกษา (แขนงวิชาเคมี)</option>
            <option value="">สาขาวิชาวิทยาศาสตร์ศึกษา (แขนงวิชาชีววิทยา)</option>

        <!-- ภาควิชาวิทยาศาสตร์ประยุกต์ -->
            <option value="">สาขาวิชาเกษตรศาสตร์</option>
            <option value="">สาขาวิชาวิทยาศาสตร์และการจัดการเทคโนโลยีการอาหาร</option>
            <option value="">สาขาวิชาอาชีวอนามัยและความปลอดภัย</option>
            <option value="">สาขาวิชาวิศวกรรมไฟฟ้า</option>
            <option value="">สาขาวิชาเทคโนโลยีการเกษตรสมัยใหม่</option>
            <option value="">สาขาวิชาวิศวกรรมการจัดการ</option>
            <option value="">สาขาวิชาคหกรรมศาสตร์</option>
            <option value="">สาขาวิชาสาธารณสุขศาสตร์</option>
            <option value="">สาขาวิชาเทคโนโลยีอุตสาหกรรม</option>

    <!-- คณะวิทยาการจัดการ -->
        <!-- หลักสูตรบริหารธุรกิจบัณฑิต -->
            <option value="">สาขาวิชาการจัดการ</option>
            <option value="">สาขาวิชาคอมพิวเตอร์ธุรกิจ</option>
            <option value="">สาขาวิชาการบริหารทรัพยากรมนุษย์</option>
            <option value="">สาขาวิชาการตลาด</option>
            <option value="">สาขาวิชาการจัดการโลจิสติกส์และซัพพลายเชน</option>
            <option value="">สาขาวิชาการจัดการธุรกิจการค้าสมัยใหม่</option>

        <!-- หลักสูตรบัญชีบัณฑิต -->
            <option value="">สาขาวิชาการบัญชี</option>

        <!-- หลักสูตรศิลปศาสตรบัณฑิต -->
            <option value="">สาขาวิชาการท่องเที่ยว</option>

        <!-- หลักสูตรเศรษฐศาสตรบัณฑิต -->
            <option value="">สาขาวิชาเศรษฐศาสตร์การเงินการธนาคาร</option>

        <!-- หลักสูตรเศรษฐศาสตรบัณฑิต -->
            <option value="">สาขาวิชาธุรกิจและอาชีวศึกษา​</option>

</select>
<label for="floatingSelect">สาขา</label>

<!-- 
    1 = ภาคปกติ
    2 = ภาคพิเศษ
-------------------------------------
    64 = ปีที่เข้า
-------------------------------------
    1 = คณะครุศาสตร์
    2 = คณะมนุษยศาสตร์และสังคมศาสตร์
    3 = คณะวิทยาศาสตร์และเทคโนโลยี
    4 = คณะวิทยาการจัดการ
-------------------------------------
    2 = สาขาที่ มั้ง
-------------------------------------
    0 = ภาควิชาวิทยาศาสตร์ มั้ง
-------------------------------------
    48 = คนที่ มั้ง


-->